IDEA Open Model
CrossSectionFactory.FillWeldedAsymI Method
Compatible with IDEA StatiCa 20.1
 Welded I asymetrical - steel shape
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillWeldedAsymI(
	CrossSectionParameter css,
	double bu,
	double bb,
	double hw,
	double tw,
	double tfu,
	double tfb
)
Public Shared Sub FillWeldedAsymI (
	css As CrossSectionParameter,
	bu As Double,
	bb As Double,
	hw As Double,
	tw As Double,
	tfu As Double,
	tfb As Double
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
bu
Type: System.Double
Width of upper flange
bb
Type: System.Double
Width of bottom flange
hw
Type: System.Double
Height of web
tw
Type: System.Double
Web thickness
tfu
Type: System.Double
Upper flange thickness
tfb
Type: System.Double
Bottom flange thickness
Remarks
Dimension of assymetrical I section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 4;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double bu = 0.150;
double bb = 0.180;
double hw = 0.320;
double tw = 0.016;
double tfu = 0.014;
double tfb = 0.018;
CrossSectionFactory.FillWeldedAsymI(css, bu, bb, hw, tw, tfu, tfb);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace